Revit 2024 API
BrowserOrganization.AreFiltersSatisfied Method
 Determines if the given element satisfies the filters defined by the browser organization.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool AreFiltersSatisfied(
	ElementId elementId
)
Visual Basic
Public Function AreFiltersSatisfied ( _
	elementId As ElementId _
) As Boolean
Visual C++
public:
bool AreFiltersSatisfied(
	ElementId^ elementId
)
Parameters
elementId
Type: Autodesk.Revit.DB.ElementId
 The element to check.
Return Value
 True if the given element satisfies the filter.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  elementId is not a valid Element identifier.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
BrowserOrganization Class
Autodesk.Revit.DB Namespace